zephyrproject-rtos/zephyr/drivers/serial/usart_gd32.c
/*
 * Copyright (c) 2021, ATL Electronics
 * Copyright (c) 2025 Aleksandr Senin <al@meshium.net>
 * Copyright (c) 2026 Liu Changjie <liucj1228@outlook.com>
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT gd_gd32_usart

#include <errno.h>

#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/gd32.h>
#ifdef CONFIG_UART_ASYNC_API
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_gd32.h>
#endif
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/irq.h>

#include <gd32_usart.h>

/* Unify GD32 HAL USART status register name to USART_STAT */
#ifndef USART_STAT
#define USART_STAT USART_STAT0
#endif
#ifndef USART_RDATA
#define USART_RDATA USART_DATA
#endif
#ifndef USART_TDATA
#define USART_TDATA USART_DATA
#endif
#ifndef USART_RECEIVE_DMA_ENABLE
#define USART_RECEIVE_DMA_ENABLE USART_DENR_ENABLE
#endif
#ifndef USART_RECEIVE_DMA_DISABLE
#define USART_RECEIVE_DMA_DISABLE USART_DENR_DISABLE
#endif
#ifndef USART_TRANSMIT_DMA_ENABLE
#define USART_TRANSMIT_DMA_ENABLE USART_DENT_ENABLE
#endif
#ifndef USART_TRANSMIT_DMA_DISABLE
#define USART_TRANSMIT_DMA_DISABLE USART_DENT_DISABLE
#endif

#ifdef CONFIG_UART_ASYNC_API
enum gd32_usart_dma_dir {
	GD32_USART_DMA_TX,
	GD32_USART_DMA_RX,
};

struct gd32_usart_dma_config {
	const struct device *dev;
	uint32_t channel;
	uint32_t slot;
	uint32_t config;
};

struct gd32_usart_dma_data {
	const struct device *uart_dev;
	struct dma_config config;
	struct dma_block_config block;
	struct k_work_delayable timeout_work;
	uint8_t *buf;
	size_t len;
	size_t offset;
	uint8_t *next_buf;
	size_t next_len;
	int32_t timeout_us;
	bool busy;
	bool requested;
	bool dma_done;
};
#endif /* CONFIG_UART_ASYNC_API */

struct gd32_usart_config {
	uint32_t reg;
	uint16_t clkid;
	struct reset_dt_spec reset;
	const struct pinctrl_dev_config *pcfg;
	uint32_t parity;
#ifdef CONFIG_UART_ASYNC_API
	const struct gd32_usart_dma_config dma_tx;
	const struct gd32_usart_dma_config dma_rx;
#endif /* CONFIG_UART_ASYNC_API */
#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
	uart_irq_config_func_t irq_config_func;
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */
};

struct gd32_usart_data {
	uint32_t baud_rate;
#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	uart_irq_callback_user_data_t user_cb;
	void *user_data;
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */
#ifdef CONFIG_UART_ASYNC_API
	uart_callback_t async_cb;
	void *async_user_data;
	struct gd32_usart_dma_data dma_tx;
	struct gd32_usart_dma_data dma_rx;
	bool rx_notifying;
	bool rx_disable_pending;
#endif /* CONFIG_UART_ASYNC_API */
#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
	enum uart_config_parity parity;
	enum uart_config_stop_bits stop_bits;
	enum uart_config_data_bits data_bits;
	enum uart_config_flow_control flow_ctrl;
	bool initialized;
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */
};

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
#ifdef CONFIG_UART_ASYNC_API
static void usart_gd32_rx_idle_clear(uint32_t reg);
static void usart_gd32_rx_idle(const struct device *dev);
static bool usart_gd32_tx_stop(const struct device *dev, bool stop_dma, uint8_t **buf,
			       size_t *sent);
static void usart_gd32_tx_complete(const struct device *dev, enum uart_event_type type,
				   uint8_t *buf, size_t len);
#endif /* CONFIG_UART_ASYNC_API */

static void usart_gd32_isr(const struct device *dev)
{
	struct gd32_usart_data *const data = dev->data;

#ifdef CONFIG_UART_ASYNC_API
	const struct gd32_usart_config *const cfg = dev->config;

	if (usart_interrupt_flag_get(cfg->reg, USART_INT_FLAG_IDLE) == SET) {
		usart_gd32_rx_idle_clear(cfg->reg);
		usart_gd32_rx_idle(dev);
	}

	if (data->dma_tx.busy && data->dma_tx.dma_done &&
	    usart_interrupt_flag_get(cfg->reg, USART_INT_FLAG_TC) == SET) {
		uint8_t *buf;
		size_t sent;

		if (usart_gd32_tx_stop(dev, true, &buf, &sent)) {
			usart_gd32_tx_complete(dev, UART_TX_DONE, buf, sent);
		}
	}
#endif /* CONFIG_UART_ASYNC_API */

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
	if (data->user_cb) {
		data->user_cb(dev, data->user_data);
	}
#endif /* CONFIG_UART_INTERRUPT_DRIVEN */
}
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */

#ifdef CONFIG_UART_ASYNC_API
static void usart_gd32_async_callback(const struct device *dev, struct uart_event *evt)
{
	struct gd32_usart_data *const data = dev->data;

	if (data->async_cb) {
		data->async_cb(dev, evt, data->async_user_data);
	}
}

static void usart_gd32_rx_idle_clear(uint32_t reg)
{
	volatile uint32_t stat;
	volatile uint32_t data;

	stat = USART_STAT(reg);
	data = USART_RDATA(reg);
	ARG_UNUSED(stat);
	ARG_UNUSED(data);

	usart_flag_clear(reg, USART_FLAG_IDLE);
}

static bool usart_gd32_dma_ready(const struct gd32_usart_dma_config *dma)
{
	return dma->dev && device_is_ready(dma->dev);
}

static bool usart_gd32_async_ready(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;

	return usart_gd32_dma_ready(&cfg->dma_tx) && usart_gd32_dma_ready(&cfg->dma_rx);
}

static int usart_gd32_dma_request_channel(const struct gd32_usart_dma_config *dma,
					  struct gd32_usart_dma_data *dma_data)
{
	uint32_t ch_filter;
	int ret;

	if (dma_data->requested) {
		return 0;
	}

	ch_filter = BIT(dma->channel);
	ret = dma_request_channel(dma->dev, &ch_filter);
	if (ret < 0) {
		return ret;
	}

	dma_data->requested = true;

	return 0;
}

static void usart_gd32_dma_release_channel(const struct gd32_usart_dma_config *dma,
					   struct gd32_usart_dma_data *dma_data)
{
	if (!dma_data->requested) {
		return;
	}

	dma_release_channel(dma->dev, dma->channel);
	dma_data->requested = false;
}

/*
 * Tear down an in-flight TX and take ownership of its completion. The transfer
 * can be ended by the USART TC interrupt, by a DMA error callback or by
 * uart_tx_abort() from a thread, so the teardown runs with interrupts locked
 * and only the first caller gets true. Any path that loses the race sees
 * busy == false and must not emit an event.
 */
static bool usart_gd32_tx_stop(const struct device *dev, bool stop_dma, uint8_t **buf, size_t *sent)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	struct dma_status status = {0};
	unsigned int key;

