zephyrproject-rtos/zephyr/drivers/serial/usart_gd32.c
	key = irq_lock();

	if (!data->dma_tx.busy) {
		irq_unlock(key);
		return false;
	}

	if (data->dma_tx.dma_done) {
		*sent = data->dma_tx.len;
	} else if (dma_get_status(cfg->dma_tx.dev, cfg->dma_tx.channel, &status) == 0) {
		*sent = data->dma_tx.len - MIN(data->dma_tx.len, status.pending_length);
	} else {
		*sent = 0U;
	}
	*buf = data->dma_tx.buf;

	usart_interrupt_disable(cfg->reg, USART_INT_TC);
	if (stop_dma) {
		(void)dma_stop(cfg->dma_tx.dev, cfg->dma_tx.channel);
	}
	usart_dma_transmit_config(cfg->reg, USART_TRANSMIT_DMA_DISABLE);

	data->dma_tx.busy = false;
	data->dma_tx.dma_done = false;
	usart_gd32_dma_release_channel(&cfg->dma_tx, &data->dma_tx);

	irq_unlock(key);

	return true;
}

static void usart_gd32_tx_complete(const struct device *dev, enum uart_event_type type,
				   uint8_t *buf, size_t len)
{
	struct uart_event evt = {
		.type = type,
		.data.tx = {
			.buf = buf,
			.len = len,
		},
	};

	usart_gd32_async_callback(dev, &evt);
}

static uint32_t usart_gd32_rx_data_addr(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;

	return (uint32_t)(uintptr_t)&USART_RDATA(cfg->reg);
}

static uint32_t usart_gd32_tx_data_addr(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;

	return (uint32_t)(uintptr_t)&USART_TDATA(cfg->reg);
}

static void usart_gd32_dma_tx_cb(const struct device *dma_dev, void *user_data, uint32_t channel,
				 int status)
{
	const struct device *dev = user_data;
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	unsigned int key;

	ARG_UNUSED(dma_dev);
	ARG_UNUSED(channel);

	if (status != 0) {
		uint8_t *buf;
		size_t sent;

		if (usart_gd32_tx_stop(dev, true, &buf, &sent)) {
			usart_gd32_tx_complete(dev, UART_TX_ABORTED, buf, sent);
		}

		return;
	}

	/*
	 * The DMA has written the last byte to TDATA, but the shift register is
	 * still busy. Wait for the USART TC flag before reporting UART_TX_DONE.
	 */
	key = irq_lock();

	if (data->dma_tx.busy) {
		data->dma_tx.dma_done = true;
		usart_interrupt_enable(cfg->reg, USART_INT_TC);
	}

	irq_unlock(key);
}

static void usart_gd32_dma_rx_cb(const struct device *dma_dev, void *user_data, uint32_t channel,
				 int status);

static void usart_gd32_rx_rdy(const struct device *dev, size_t len)
{
	struct gd32_usart_data *const data = dev->data;

	if (len > data->dma_rx.offset) {
		struct uart_event evt = {
			.type = UART_RX_RDY,
			.data.rx = {
				.buf = data->dma_rx.buf,
				.len = len - data->dma_rx.offset,
				.offset = data->dma_rx.offset,
			},
		};

		data->dma_rx.offset = len;
		usart_gd32_async_callback(dev, &evt);
	}
}

static void usart_gd32_rx_release(const struct device *dev, uint8_t *buf)
{
	struct uart_event release_evt = {
		.type = UART_RX_BUF_RELEASED,
		.data.rx_buf = {
			.buf = buf,
		},
	};

	usart_gd32_async_callback(dev, &release_evt);
}

static void usart_gd32_rx_request(const struct device *dev)
{
	struct uart_event request_evt = {
		.type = UART_RX_BUF_REQUEST,
	};

	usart_gd32_async_callback(dev, &request_evt);
}

static void usart_gd32_rx_disabled(const struct device *dev)
{
	struct uart_event disabled_evt = {
		.type = UART_RX_DISABLED,
	};

	usart_gd32_async_callback(dev, &disabled_evt);
}

static bool usart_gd32_rx_timeout_enabled(const struct device *dev)
{
	struct gd32_usart_data *const data = dev->data;

	return data->dma_rx.timeout_us != SYS_FOREVER_US;
}

static void usart_gd32_rx_idle_enable(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;

	if (!usart_gd32_rx_timeout_enabled(dev)) {
		return;
	}

	usart_gd32_rx_idle_clear(cfg->reg);
	usart_interrupt_enable(cfg->reg, USART_INT_IDLE);
}

static void usart_gd32_rx_idle_disable(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;

	usart_interrupt_disable(cfg->reg, USART_INT_IDLE);
	(void)k_work_cancel_delayable(&data->dma_rx.timeout_work);
}

static size_t usart_gd32_rx_received_len(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	struct dma_status status = {0};

	if (dma_get_status(cfg->dma_rx.dev, cfg->dma_rx.channel, &status) != 0) {
		return 0U;
	}

	return data->dma_rx.len - MIN(data->dma_rx.len, status.pending_length);
}

/* Called with interrupts locked; do not accept a new RX until all buffers are released. */
static void usart_gd32_rx_stop(const struct device *dev, size_t len, int reason)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	uint8_t *buf = data->dma_rx.buf;
	uint8_t *next_buf = data->dma_rx.next_buf;
	struct uart_event rdy_evt = {
		.type = UART_RX_RDY,
		.data.rx.buf = buf,
		.data.rx.offset = data->dma_rx.offset,
		.data.rx.len = len - MIN(len, data->dma_rx.offset),
	};

	usart_gd32_rx_idle_disable(dev);
	usart_dma_receive_config(cfg->reg, USART_RECEIVE_DMA_DISABLE);
	(void)dma_stop(cfg->dma_rx.dev, cfg->dma_rx.channel);

	data->dma_rx.buf = NULL;
	data->dma_rx.len = 0U;
	data->dma_rx.offset = 0U;
	data->dma_rx.next_buf = NULL;
	data->dma_rx.next_len = 0U;
	data->dma_rx.busy = false;
	data->rx_notifying = true;
	data->rx_disable_pending = false;
	usart_gd32_dma_release_channel(&cfg->dma_rx, &data->dma_rx);

	if (reason != 0) {
		struct uart_event stopped_evt = {
			.type = UART_RX_STOPPED,
			.data.rx_stop.reason = reason,
			.data.rx_stop.data = rdy_evt.data.rx,
		};

		usart_gd32_async_callback(dev, &stopped_evt);
	}
	if (rdy_evt.data.rx.len != 0U) {
		usart_gd32_async_callback(dev, &rdy_evt);
	}
	if (buf != NULL) {
		usart_gd32_rx_release(dev, buf);
	}
	if (next_buf != NULL) {
		usart_gd32_rx_release(dev, next_buf);
	}

	data->rx_notifying = false;
	usart_gd32_rx_disabled(dev);
}

static int usart_gd32_dma_configure(const struct device *dev, enum gd32_usart_dma_dir dir,
				    uint8_t *buf, size_t len)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	const struct gd32_usart_dma_config *dma;
	struct gd32_usart_dma_data *dma_data;
	int ret;

	if (dir == GD32_USART_DMA_TX) {
		dma = &cfg->dma_tx;
		dma_data = &data->dma_tx;
	} else {
		dma = &cfg->dma_rx;
		dma_data = &data->dma_rx;
	}

