zephyrproject-rtos/zephyr/drivers/serial/usart_gd32.c
	if (!usart_gd32_dma_ready(dma)) {
		return -ENODEV;
	}

	ret = usart_gd32_dma_request_channel(dma, dma_data);
	if (ret < 0) {
		return ret;
	}

	memset(&dma_data->config, 0, sizeof(dma_data->config));
	memset(&dma_data->block, 0, sizeof(dma_data->block));

	dma_data->config.dma_slot = dma->slot;
	dma_data->config.channel_priority = GD32_DMA_CONFIG_PRIORITY(dma->config);
	dma_data->config.block_count = 1U;
	dma_data->config.head_block = &dma_data->block;
	dma_data->config.user_data = (void *)dev;
	dma_data->config.source_burst_length = 1U;
	dma_data->config.dest_burst_length = 1U;
	dma_data->config.source_data_size = 1U;
	dma_data->config.dest_data_size = 1U;

	dma_data->block.block_size = len;

	if (dir == GD32_USART_DMA_TX) {
		dma_data->config.channel_direction = MEMORY_TO_PERIPHERAL;
		dma_data->config.dma_callback = usart_gd32_dma_tx_cb;
		dma_data->block.source_address = (uint32_t)(uintptr_t)buf;
		dma_data->block.dest_address = usart_gd32_tx_data_addr(dev);
		dma_data->block.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		dma_data->block.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
	} else {
		dma_data->config.channel_direction = PERIPHERAL_TO_MEMORY;
		dma_data->config.dma_callback = usart_gd32_dma_rx_cb;
		dma_data->block.source_address = usart_gd32_rx_data_addr(dev);
		dma_data->block.dest_address = (uint32_t)(uintptr_t)buf;
		dma_data->block.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		dma_data->block.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
	}

	dma_data->buf = buf;
	dma_data->len = len;
	dma_data->offset = 0U;

	return dma_config(dma->dev, dma->channel, &dma_data->config);
}

static int usart_gd32_rx_start(const struct device *dev, uint8_t *buf, size_t len)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	int ret;

	ret = usart_gd32_dma_configure(dev, GD32_USART_DMA_RX, buf, len);
	if (ret < 0) {
		goto fail;
	}

	data->dma_rx.busy = true;
	usart_dma_receive_config(cfg->reg, USART_RECEIVE_DMA_ENABLE);

	ret = dma_start(cfg->dma_rx.dev, cfg->dma_rx.channel);
	if (ret < 0) {
		usart_dma_receive_config(cfg->reg, USART_RECEIVE_DMA_DISABLE);
		goto fail;
	}

	usart_gd32_rx_idle_enable(dev);

	return 0;

fail:
	data->dma_rx.buf = NULL;
	data->dma_rx.len = 0U;
	data->dma_rx.offset = 0U;
	data->dma_rx.busy = false;
	usart_gd32_dma_release_channel(&cfg->dma_rx, &data->dma_rx);
	return ret;
}

static void usart_gd32_dma_rx_cb(const struct device *dma_dev, void *user_data, uint32_t channel,
				 int status)
{
	const struct device *dev = user_data;
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	struct uart_event rdy_evt;
	uint8_t *buf;
	uint8_t *next_buf;
	size_t next_len;
	unsigned int key;
	int ret = 0;

	ARG_UNUSED(dma_dev);
	ARG_UNUSED(channel);

	key = irq_lock();
	if (!data->dma_rx.busy) {
		goto unlock;
	}

	if (status != 0) {
		usart_gd32_rx_stop(dev, usart_gd32_rx_received_len(dev), UART_ERROR_OVERRUN);
		goto unlock;
	}

	usart_gd32_rx_idle_disable(dev);
	usart_dma_receive_config(cfg->reg, USART_RECEIVE_DMA_DISABLE);

	buf = data->dma_rx.buf;
	rdy_evt = (struct uart_event){
		.type = UART_RX_RDY,
		.data.rx.buf = buf,
		.data.rx.len = data->dma_rx.len - data->dma_rx.offset,
		.data.rx.offset = data->dma_rx.offset,
	};
	next_buf = data->dma_rx.next_buf;
	next_len = data->dma_rx.next_len;
	data->dma_rx.next_buf = NULL;
	data->dma_rx.next_len = 0U;
	data->dma_rx.buf = NULL;
	data->dma_rx.len = 0U;
	data->dma_rx.offset = 0U;
	data->dma_rx.busy = false;

	/* Commit the buffer handoff before callbacks can supply another buffer. */
	if (next_buf != NULL) {
		ret = usart_gd32_rx_start(dev, next_buf, next_len);
	} else {
		usart_gd32_dma_release_channel(&cfg->dma_rx, &data->dma_rx);
	}

	/* A reentrant disable must not release the new buffer ahead of the old one. */
	data->rx_notifying = true;
	if (rdy_evt.data.rx.len != 0U) {
		usart_gd32_async_callback(dev, &rdy_evt);
	}
	usart_gd32_rx_release(dev, buf);
	if (ret < 0) {
		usart_gd32_rx_release(dev, next_buf);
	}
	data->rx_notifying = false;

	if (!data->dma_rx.busy) {
		usart_gd32_rx_disabled(dev);
	} else if (data->rx_disable_pending) {
		usart_gd32_rx_stop(dev, usart_gd32_rx_received_len(dev), 0);
	} else {
		usart_gd32_rx_request(dev);
	}

unlock:
	irq_unlock(key);
}

static void usart_gd32_rx_idle(const struct device *dev)
{
	struct gd32_usart_data *const data = dev->data;
	size_t len;

	if (!data->dma_rx.busy || !usart_gd32_rx_timeout_enabled(dev)) {
		return;
	}

	len = usart_gd32_rx_received_len(dev);
	if (len <= data->dma_rx.offset) {
		return;
	}

	(void)k_work_reschedule(&data->dma_rx.timeout_work, K_USEC(data->dma_rx.timeout_us));
}

static void usart_gd32_rx_timeout(struct k_work *work)
{
	struct k_work_delayable *dwork = k_work_delayable_from_work(work);
	struct gd32_usart_dma_data *dma_rx =
		CONTAINER_OF(dwork, struct gd32_usart_dma_data, timeout_work);
	const struct device *dev = dma_rx->uart_dev;
	size_t len;
	unsigned int key;

	key = irq_lock();

	if (!dma_rx->busy) {
		irq_unlock(key);
		return;
	}

	len = usart_gd32_rx_received_len(dev);
	if (len <= dma_rx->offset) {
		irq_unlock(key);
		return;
	}

	usart_gd32_rx_rdy(dev, len);

	irq_unlock(key);
}

static int usart_gd32_callback_set(const struct device *dev, uart_callback_t callback,
				   void *user_data)
{
	struct gd32_usart_data *const data = dev->data;

	if (!usart_gd32_async_ready(dev)) {
		return -ENOSYS;
	}

	data->async_cb = callback;
	data->async_user_data = user_data;

	return 0;
}

static int usart_gd32_tx(const struct device *dev, const uint8_t *buf, size_t len, int32_t timeout)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	int ret;

	ARG_UNUSED(timeout);

	if (buf == NULL || len == 0U) {
		return -EINVAL;
	}

	if (data->dma_tx.busy) {
		return -EBUSY;
	}

	if (!usart_gd32_dma_ready(&cfg->dma_tx)) {
		return -ENODEV;
	}

	ret = usart_gd32_dma_configure(dev, GD32_USART_DMA_TX, (uint8_t *)buf, len);
	if (ret < 0) {
		return ret;
	}

	data->dma_tx.busy = true;
	data->dma_tx.dma_done = false;
	usart_interrupt_disable(cfg->reg, USART_INT_TC);
	usart_interrupt_flag_clear(cfg->reg, USART_INT_FLAG_TC);
	usart_dma_transmit_config(cfg->reg, USART_TRANSMIT_DMA_ENABLE);

	ret = dma_start(cfg->dma_tx.dev, cfg->dma_tx.channel);
	if (ret < 0) {
		usart_dma_transmit_config(cfg->reg, USART_TRANSMIT_DMA_DISABLE);
		data->dma_tx.busy = false;
		usart_gd32_dma_release_channel(&cfg->dma_tx, &data->dma_tx);
		return ret;
	}

