zephyrproject-rtos/zephyr/drivers/serial/usart_gd32.c
	return 0;
}

static int usart_gd32_tx_abort(const struct device *dev)
{
	uint8_t *buf;
	size_t sent;

	if (!usart_gd32_tx_stop(dev, true, &buf, &sent)) {
		return -EFAULT;
	}

	usart_gd32_tx_complete(dev, UART_TX_ABORTED, buf, sent);

	return 0;
}

static int usart_gd32_rx_enable(const struct device *dev, uint8_t *buf, size_t len, int32_t timeout)
{
	struct gd32_usart_data *const data = dev->data;
	unsigned int key;
	int ret;

	if (buf == NULL || len == 0U) {
		return -EINVAL;
	}

	if (timeout < 0 && timeout != SYS_FOREVER_US) {
		return -EINVAL;
	}

	key = irq_lock();
	if (data->dma_rx.busy || data->rx_notifying) {
		ret = -EBUSY;
		goto unlock;
	}

	data->dma_rx.next_buf = NULL;
	data->dma_rx.next_len = 0U;
	data->dma_rx.timeout_us = timeout;
	ret = usart_gd32_rx_start(dev, buf, len);
	if (ret < 0) {
		goto unlock;
	}

	usart_gd32_rx_request(dev);

unlock:
	irq_unlock(key);
	return ret;
}

static int usart_gd32_rx_disable(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	unsigned int key;

	key = irq_lock();
	if (!data->dma_rx.busy || data->rx_disable_pending) {
		irq_unlock(key);
		return -EFAULT;
	}

	usart_gd32_rx_idle_disable(dev);
	usart_dma_receive_config(cfg->reg, USART_RECEIVE_DMA_DISABLE);
	(void)dma_stop(cfg->dma_rx.dev, cfg->dma_rx.channel);

	if (data->rx_notifying) {
		data->rx_disable_pending = true;
	} else {
		usart_gd32_rx_stop(dev, usart_gd32_rx_received_len(dev), 0);
	}

	irq_unlock(key);
	return 0;
}

static int usart_gd32_rx_buf_rsp(const struct device *dev, uint8_t *buf, size_t len)
{
	struct gd32_usart_data *const data = dev->data;
	unsigned int key;
	int ret = 0;

	if (buf == NULL || len == 0U) {
		return -EINVAL;
	}

	key = irq_lock();
	if (!data->dma_rx.busy || data->rx_disable_pending) {
		ret = -EACCES;
		goto unlock;
	}

	if (data->dma_rx.next_buf) {
		ret = -EBUSY;
		goto unlock;
	}

	data->dma_rx.next_buf = buf;
	data->dma_rx.next_len = len;

unlock:
	irq_unlock(key);
	return ret;
}
#endif /* CONFIG_UART_ASYNC_API */

static int usart_gd32_init(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	uint32_t word_length;
	uint32_t parity;
	int ret;

	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	/**
	 * In order to keep the transfer data size to 8 bits(1 byte),
	 * append word length to 9BIT if parity bit enabled.
	 */
	switch (cfg->parity) {
	case UART_CFG_PARITY_NONE:
		parity = USART_PM_NONE;
		word_length = USART_WL_8BIT;
		break;
	case UART_CFG_PARITY_ODD:
		parity = USART_PM_ODD;
		word_length = USART_WL_9BIT;
		break;
	case UART_CFG_PARITY_EVEN:
		parity = USART_PM_EVEN;
		word_length = USART_WL_9BIT;
		break;
	default:
		return -ENOTSUP;
	}

	(void)clock_control_on(GD32_CLOCK_CONTROLLER,
			       (clock_control_subsys_t)&cfg->clkid);

	(void)reset_line_toggle_dt(&cfg->reset);

	usart_baudrate_set(cfg->reg, data->baud_rate);
	usart_parity_config(cfg->reg, parity);
	usart_word_length_set(cfg->reg, word_length);
	/* Default to 1 stop bit */
	usart_stop_bit_set(cfg->reg, USART_STB_1BIT);
	usart_receive_config(cfg->reg, USART_RECEIVE_ENABLE);
	usart_transmit_config(cfg->reg, USART_TRANSMIT_ENABLE);
	usart_enable(cfg->reg);

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
	cfg->irq_config_func(dev);
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */
#ifdef CONFIG_UART_ASYNC_API
	data->dma_tx.uart_dev = dev;
	data->dma_rx.uart_dev = dev;
	data->dma_rx.timeout_us = SYS_FOREVER_US;
	k_work_init_delayable(&data->dma_rx.timeout_work, usart_gd32_rx_timeout);
#endif /* CONFIG_UART_ASYNC_API */
#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
	/* Initialize runtime configuration from Devicetree defaults */
	data->parity = cfg->parity;
	data->data_bits = UART_CFG_DATA_BITS_8;
	data->stop_bits = UART_CFG_STOP_BITS_1;
	data->flow_ctrl = UART_CFG_FLOW_CTRL_NONE;
	data->initialized = true;
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */
	return 0;
}

static int usart_gd32_poll_in(const struct device *dev, unsigned char *c)
{
	const struct gd32_usart_config *const cfg = dev->config;
	uint32_t status;

	status = usart_flag_get(cfg->reg, USART_FLAG_RBNE);

	if (!status) {
		return -EPERM;
	}

	*c = usart_data_receive(cfg->reg);

	return 0;
}

static void usart_gd32_poll_out(const struct device *dev, unsigned char c)
{
	const struct gd32_usart_config *const cfg = dev->config;

	usart_data_transmit(cfg->reg, c);

	while (usart_flag_get(cfg->reg, USART_FLAG_TBE) == RESET) {
		;
	}
}

static int usart_gd32_err_check(const struct device *dev)
{
	const struct gd32_usart_config *const cfg = dev->config;
	uint32_t status = USART_STAT(cfg->reg);
	int errors = 0;

	if (status & USART_FLAG_ORERR) {
		usart_flag_clear(cfg->reg, USART_FLAG_ORERR);

		errors |= UART_ERROR_OVERRUN;
	}

	if (status & USART_FLAG_PERR) {
		usart_flag_clear(cfg->reg, USART_FLAG_PERR);

		errors |= UART_ERROR_PARITY;
	}

	if (status & USART_FLAG_FERR) {
		usart_flag_clear(cfg->reg, USART_FLAG_FERR);

		errors |= UART_ERROR_FRAMING;
	}

	usart_flag_clear(cfg->reg, USART_FLAG_NERR);

	return errors;
}

#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
static int usart_gd32_configure(const struct device *dev, const struct uart_config *cfg_new)
{
	const struct gd32_usart_config *const cfg = dev->config;
	struct gd32_usart_data *const data = dev->data;
	uint32_t parity_bits;
	uint32_t word_length;
	uint32_t stop_bits_hw;

	if (cfg_new == NULL) {
		return -EINVAL;
	}

	if (cfg_new->baudrate == 0U) {
		return -EINVAL;
	}

	if (cfg_new->flow_ctrl != UART_CFG_FLOW_CTRL_NONE) {
		return -ENOTSUP;
	}

	switch (cfg_new->parity) {
	case UART_CFG_PARITY_NONE:
		parity_bits = USART_PM_NONE;
		break;
	case UART_CFG_PARITY_ODD:
		parity_bits = USART_PM_ODD;
		break;
	case UART_CFG_PARITY_EVEN:
		parity_bits = USART_PM_EVEN;
		break;
	default:
		return -EINVAL;
	}

	switch (cfg_new->data_bits) {
	case UART_CFG_DATA_BITS_8:
	case UART_CFG_DATA_BITS_7:
		break;
	default:
		return -EINVAL;
	}

	if (cfg_new->data_bits == UART_CFG_DATA_BITS_7 && cfg_new->parity == UART_CFG_PARITY_NONE) {
		return -EINVAL;
	}

