zephyrproject-rtos/zephyr/drivers/serial/usart_gd32.c
#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
#define GD32_USART_IRQ_HANDLER(n)						\
	static void usart_gd32_config_func_##n(const struct device *dev)	\
	{									\
		IRQ_CONNECT(DT_INST_IRQN(n),					\
			    DT_INST_IRQ(n, priority),				\
			    usart_gd32_isr,					\
			    DEVICE_DT_INST_GET(n),				\
			    0);							\
		irq_enable(DT_INST_IRQN(n));					\
	}
#define GD32_USART_IRQ_HANDLER_FUNC_INIT(n)					\
	.irq_config_func = usart_gd32_config_func_##n
#else /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */
#define GD32_USART_IRQ_HANDLER(n)
#define GD32_USART_IRQ_HANDLER_FUNC_INIT(n)
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */

#ifdef CONFIG_UART_ASYNC_API
#define GD32_USART_DMA_INITIALIZER(idx, dir)					\
	{									\
		.dev = DEVICE_DT_GET(DT_INST_DMAS_CTLR_BY_NAME(idx, dir)),	\
		.channel = DT_INST_DMAS_CELL_BY_NAME(idx, dir, channel),		\
		.slot = COND_CODE_1(						\
			DT_HAS_COMPAT_STATUS_OKAY(gd_gd32_dma_v1),		\
			(DT_INST_DMAS_CELL_BY_NAME(idx, dir, slot)), (0)),	\
		.config = DT_INST_DMAS_CELL_BY_NAME(idx, dir, config),		\
		}

#define GD32_USART_DMA_INIT(idx, dir)						\
	COND_CODE_1(DT_INST_DMAS_HAS_NAME(idx, dir),				\
		    (GD32_USART_DMA_INITIALIZER(idx, dir)), ({0}))

#define GD32_USART_DMA_CONFIG_INIT(n)						\
	.dma_tx = GD32_USART_DMA_INIT(n, tx),					\
	.dma_rx = GD32_USART_DMA_INIT(n, rx),
#else
#define GD32_USART_DMA_CONFIG_INIT(n)
#endif /* CONFIG_UART_ASYNC_API */

#define GD32_USART_INIT(n)							\
	PINCTRL_DT_INST_DEFINE(n);						\
	GD32_USART_IRQ_HANDLER(n)						\
	static struct gd32_usart_data usart_gd32_data_##n = {			\
		.baud_rate = DT_INST_PROP(n, current_speed),			\
	};									\
	static const struct gd32_usart_config usart_gd32_config_##n = {		\
		.reg = DT_INST_REG_ADDR(n),					\
		.clkid = DT_INST_CLOCKS_CELL(n, id),				\
		.reset = RESET_DT_SPEC_INST_GET(n),				\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(n),			\
		.parity = DT_INST_ENUM_IDX(n, parity),				\
		GD32_USART_DMA_CONFIG_INIT(n)					\
		 GD32_USART_IRQ_HANDLER_FUNC_INIT(n)				\
	};									\
	DEVICE_DT_INST_DEFINE(n, usart_gd32_init,				\
			      NULL,						\
			      &usart_gd32_data_##n,				\
			      &usart_gd32_config_##n, PRE_KERNEL_1,		\
			      CONFIG_SERIAL_INIT_PRIORITY,			\
			      &usart_gd32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(GD32_USART_INIT)
